---
type: ExecutedEventArgs
namespace: Autodesk.Revit.UI.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# ExecutedEventArgs

`Autodesk.Revit.UI.Events.ExecutedEventArgs` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetJournalData | 2017 | `public IDictionary < string , string > GetJournalData ()` |
| Method | SetJournalData | 2017 | `public void SetJournalData ( IDictionary < string , string > data )` |